Repository: stanercelik/PolyNap
Catalog: polynap/Resources/Localizations/MainScreen.xcstrings
Source language: en
Languages: de, ja, ms, th, tr

# sleepBlock.autoType
source: Block type will be automatically determined based on length. Blocks longer than 45 minutes will be Core Sleep, shorter will be Nap.
de: Der Blocktyp wird automatisch basierend auf der Länge bestimmt. Blöcke, die länger als 45 Minuten sind, werden als Kernschlaf, kürzere als Nickerchen eingestuft.
ja: ブロックの種類は時間によって自動で決まります。45分より長いブロックは「主睡眠」、それより短い場合は「仮眠」になります。
ms: Jenis blok akan ditentukan secara automatik berdasarkan panjang. Blok yang lebih lama daripada 45 minit akan menjadi Tidur Teras, yang lebih pendek akan menjadi Tidur Sebentar.
th: ประเภทของช่วงการนอนจะถูกกำหนดโดยอัตโนมัติตามความยาว ช่วงที่ยาวกว่า 45 นาทีจะเป็นการนอนหลัก, สั้นกว่าจะเป็นการงีบ
tr: Blok türü süreye bağlı olarak otomatik belirlenecektir. 45 dakikadan uzun bloklar Ana Uyku, daha kısa olanlar Şekerleme olacaktır.

# sleepBlock.core
source: Core sleep
de: Kernschlaf
ja: 主睡眠
ms: Tidur teras
th: การนอนหลัก
tr: Ana uyku

# sleepBlock.delete.confirm
source: Delete
de: Löschen
ja: 削除
ms: Padam
th: ลบ
tr: Sil

# sleepBlock.delete.message
source: Are you sure you want to delete this sleep block?
de: Bist du sicher, dass du diesen Schlafblock löschen möchtest?
ja: この睡眠ブロックを削除してもよろしいですか？
ms: Adakah anda pasti mahu memadam blok tidur ini?
th: คุณแน่ใจหรือไม่ว่าต้องการลบช่วงการนอนนี้?
tr: Bu uyku bloğunu silmek istediğinizden emin misiniz?

# sleepBlock.delete.title
source: Delete Sleep Block
de: Schlafblock löschen
ja: 睡眠ブロックを削除
ms: Padam Blok Tidur
th: ลบช่วงการนอน
tr: Uyku Bloğunu Sil

# sleepBlock.description
source: Block %1$@: %2$@ from %3$@ to %4$@
de: Block %1$@: %2$@ von %3$@ bis %4$@
ja: ブロック %1$@: %2$@ (%3$@〜%4$@)
ms: Blok %1$@: %2$@ dari %3$@ hingga %4$@
th: ช่วง %1$@: %2$@ จาก %3$@ ถึง %4$@
tr: Blok %1$@: %3$@ ile %4$@ arasında %2$@

# sleepBlock.duration
source: Duration
de: Dauer
ja: 時間
ms: Tempoh
th: ระยะเวลา
tr: Süre

# sleepBlock.edit
source: Edit
de: Bearbeiten
ja: 編集
ms: Sunting
th: แก้ไข
tr: Düzenle

# sleepBlock.endTime
source: End Time
de: Endzeit
ja: 終了時刻
ms: Masa Tamat
th: เวลาสิ้นสุด
tr: Bitiş Zamanı

# sleepBlock.error.invalidTime
source: End time must be after start time
de: Die Endzeit muss nach der Startzeit liegen
ja: 終了時刻は開始時刻より後に設定してください
ms: Masa tamat mestilah selepas masa mula
th: เวลาสิ้นสุดต้องอยู่หลังเวลาเริ่มต้น
tr: Bitiş zamanı başlangıç zamanından sonra olmalıdır

# sleepBlock.error.overlap
source: Sleep blocks cannot overlap
de: Schlafblöcke dürfen sich nicht überschneiden
ja: 睡眠ブロックは重複できません
ms: Blok tidur tidak boleh bertindih
th: ช่วงการนอนไม่สามารถทับซ้อนกันได้
tr: Uyku blokları çakışamaz

# sleepBlock.error.title
source: Invalid Sleep Block
de: Ungültiger Schlafblock
ja: 無効な睡眠ブロック
ms: Blok Tidur Tidak Sah
th: ช่วงการนอนไม่ถูกต้อง
tr: Geçersiz Uyku Bloğu

# sleepBlock.existing.title
source: Existing Sleep Blocks
de: Bestehende Schlafblöcke
ja: 既存の睡眠ブロック
ms: Blok Tidur Sedia Ada
th: ช่วงการนอนที่มีอยู่
tr: Var Olan Uyku Blokları

# sleepBlock.isCore
source: Main Sleep Block
de: Hauptschlafblock
ja: 主睡眠ブロック
ms: Blok Tidur Utama
th: ช่วงการนอนหลัก
tr: Ana Uyku Bloğu

# sleepBlock.nap
source: Nap
de: Nickerchen
ja: 仮眠
ms: Tidur Sebentar
th: งีบ
tr: Şekerleme

# sleepBlock.startTime
source: Start Time
de: Startzeit
ja: 開始時刻
ms: Masa Mula
th: เวลาเริ่มต้น
tr: Başlangıç Zamanı

# sleepBlock.type.core
source: Core
de: Kern
ja: 主睡眠
ms: Teras
th: การนอนหลัก
tr: Ana Uyku

# sleepBlock.type.nap
source: Nap
de: Nickerchen
ja: 仮眠
ms: Tidur Sebentar
th: งีบ
tr: Şekerleme

# sleepBlock.typeTitle
source: Block Type
de: Blocktyp
ja: ブロックの種類
ms: Jenis Blok
th: ประเภทช่วงการนอน
tr: Blok Türü

# sleepBlock.validation.minimumDuration
source: Sleep block must be at least 15 minutes
de: Der Schlafblock muss mindestens 15 Minuten lang sein
ja: 睡眠ブロックは最低15分必要です
ms: Blok tidur mestilah sekurang-kurangnya 15 minit
th: ช่วงการนอนต้องมีอย่างน้อย 15 นาที
tr: Uyku bloğu en az 15 dakika olmalıdır

# sleepBlock.validation.timeConflict
source: This time conflicts with an existing sleep block
de: Diese Zeit kollidiert mit einem bestehenden Schlafblock
ja: この時間は既存の睡眠ブロックと重複しています
ms: Masa ini bercanggah dengan blok tidur sedia ada
th: เวลานี้ขัดแย้งกับช่วงการนอนที่มีอยู่
tr: Bu saat mevcut bir uyku bloğu ile çakışıyor

# sleepQuality.later
source: Later
de: Später
ja: 後で
ms: Kemudian
th: ไว้ทีหลัง
tr: Daha Sonra

# sleepQuality.notification.title
source: Rate Your Sleep
de: Bewerte deinen Schlaf
ja: 睡眠を評価しよう
ms: Nilaikan Tidur Anda
th: ให้คะแนนการนอนของคุณ
tr: Uykunu Puanla

# sleepQuality.question
source: How was your sleep between
de: Wie war dein Schlaf zwischen
ja: この時間の睡眠はどうでしたか
ms: Bagaimana tidur anda antara
th: การนอนของคุณระหว่าง
tr: Bu saatler arasında uykun nasıldı

# sleepQuality.question %@ %@
source: How was your sleep between %1$@ - %2$@?
de: Wie war dein Schlaf zwischen %1$@ - %2$@?
ja: %1$@から%2$@までの睡眠はどうでしたか？
ms: Bagaimana tidur anda antara %1$@ - %2$@?
th: การนอนของคุณระหว่าง %1$@ - %2$@ เป็นอย่างไรบ้าง?
tr: %1$@ ve %2$@ saatleri arasındaki uykun nasıldı?

# sleepQuality.rating.bad
source: Bad
de: Schlecht
ja: 悪い
ms: Teruk
th: ไม่ดี
tr: Kötü

# sleepQuality.rating.excellent
source: Excellent
de: Ausgezeichnet
ja: 最高
ms: Cemerlang
th: ยอดเยี่ยม
tr: Mükemmel

# sleepQuality.rating.good
source: Good
de: Gut
ja: 良い
ms: Baik
th: ดี
tr: İyi

# sleepQuality.rating.poor
source: Poor
de: Mangelhaft
ja: あまり良くない
ms: Kurang Baik
th: แย่
tr: Orta

# sleepQuality.rating.veryGood
source: Very Good
de: Sehr gut
ja: とても良い
ms: Sangat Baik
th: ดีมาก
tr: Çok İyi

# sleepQuality.save
source: Save
de: Speichern
ja: 保存
ms: Simpan
th: บันทึก
tr: Kaydet

# sleepQuality.snackbar.message
source: You can still rate your sleep in History page!
de: Du kannst deinen Schlaf immer noch auf der Verlaufsseite bewerten!
ja: 履歴ページで後から睡眠を評価することもできます！
ms: Anda masih boleh menilai tidur anda di halaman Sejarah!
th: คุณยังสามารถให้คะแนนการนอนของคุณได้ในหน้าประวัติ!
tr: Geçmiş sayfasından uykunu puanlayabilirsin!

# sleepSchedule.description
source: Sleep schedule: %@
de: Schlafplan: %@
ja: 睡眠スケジュール: %@
ms: Jadual tidur: %@
th: ตารางการนอน: %@
tr: Uyku programı: %@

# mainScreen.chart.instruction.add
source: Drag from + button to add new block
de: Neuen Block hinzufügen durch Ziehen vom + Button
ja: + ボタンをドラッグして新しいブロックを追加
ms: Seret dari butang + untuk tambah blok baru
th: ลากจากปุ่ม + เพื่อเพิ่มบล็อกใหม่
tr: Yeni blok eklemek için + butonundan sürükleyin

# mainScreen.chart.instruction.delete
source: Drag blocks to trash to delete
de: Blöcke zum Löschen in den Papierkorb ziehen
ja: ブロックをゴミ箱にドラッグして削除
ms: Seret blok ke tong sampah untuk padam
th: ลากบล็อกไปที่ถังขยะเพื่อลบ
tr: Blokları silmek için çöp kutusuna sürükleyin

# mainScreen.chart.instruction.move
source: Drag blocks to move them
de: Blöcke zum Verschieben ziehen
ja: ブロックをドラッグして移動
ms: Seret blok untuk mengalihkan
th: ลากบล็อกเพื่อย้าย
tr: Blokları taşımak için sürükleyin

# general.ok
source: Okay
ja: OK
ms: OK
th: ตกลง
tr: Tamam

# mainScreen.chart.editFeedback.duration
source: %dmin
ja: %d分
th: %d นาที
tr: %ddk

# mainScreen.chart.editInstructions2
source: Minimum 15min
ja: 最低15分
th: อย่างน้อย 15 นาที
tr: Minimum 15dk

# mainScreen.segment.details
source: Details
ja: 詳細
ms: Butiran
th: รายละเอียด
tr: Detaylar

# scheduleSelection.details
source: Details
ja: 詳細
ms: Butiran
th: รายละเอียด
tr: Detaylar

# scheduleSelection.premium.title
source: Premium
ja: プレミアム
th: พรีเมียม
